Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsType
The type of a piece of DirectContext3D graphics from a DirectContext3D.
Since:
2026

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsType.Object
An object in the DirectContext3D.

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsType.Category
A category in the DirectContext3D.

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsType.Undefined
Undefined type for a piece of graphics in the DirectContext3D.